1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета2_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПеремещениеПаллета2_0</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПаллетыВСекциях</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ПаллетыВСекциях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ПаллетыВСекциях</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_СкладскиеСекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаданиеНаОтборРазмещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаданиеНаОтборРазмещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПаллетыВСекциях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыСкладскихЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресТранзит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаданийСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПриПодборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета2_0</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ФормированиеПаллета2_0</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКудаФакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета2_0/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(АдресХранения) Тогда
		Склад = АдресХранения.Владелец;
		Площадка = АдресХранения.Лико_Площадка;
		Организация = АдресХранения.Лико_Организация;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик проведения документа
//
// Параметры:
//  Отказ - Булево - флаг отказа от проведения
//  РежимПроведения - РежимПроведенияДокумента - режим проведения документа
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
   	УстановитьПривилегированныйРежим(Истина);

    // 1. Выполнение всех проверок перед проведением
    ВыполнитьПроверкиПередПроведением(Отказ, РежимПроведения);
    Если Отказ Тогда
        Возврат;
    КонецЕсли;

    // 2. Подготовка данных для проведения
    ТаблицаСерий = ПодготовитьДанныеДляПроведения(Отказ);
    Если Отказ Тогда
        Возврат;
    КонецЕсли;

    // 3. Формирование движений по регистрам
    СформироватьДвиженияДокумента(ТаблицаСерий); 
	
	Документы.Лико_ЗаданиеНаОтборРазмещение.ОбработатьЗадание(Ссылка);


КонецПроцедуры

// Обработчик удаления проведения документа (отмена проведения)
//
// Параметры:
//  Отказ - Булево - флаг отказа от удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)
    
    // Пропускаем проверку при загрузке данных
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
    // Проверка наличия зависимых документов
    ПроверитьНаличиеЗависимыхДокументов(Отказ);
    Документы.Лико_ЗаданиеНаОтборРазмещение.Отменитьзадание(Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет все проверки перед проведением документа
//
// Параметры:
//  Отказ - Булево - флаг отказа от проведения (выходной параметр)
//  РежимПроведения - РежимПроведенияДокумента - режим проведения документа
//
Процедура ВыполнитьПроверкиПередПроведением(Отказ, РежимПроведения)

    // Проверка заполнения обязательных полей
    Если НЕ ЗначениеЗаполнено(Паллет) Тогда
        СообщитьОбОшибке("Не заполнено поле 'Паллет'");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(АдресХранения) Тогда
        СообщитьОбОшибке("Не заполнено поле 'Адрес хранения'");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Проверка последовательности проведения документов по сериям
    // Выполняется только в неоперативном режиме для производительности
    // Пропускается при загрузке данных и если установлен флаг пропуска
    Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда

        ПропуститьПроверку = ОбменДанными.Загрузка
            ИЛИ ДополнительныеСвойства.Свойство("ПропуститьПроверкуПоследовательности");

        Если НЕ ПропуститьПроверку Тогда
            ПроверитьПроведениеЗаднимЧислом(Отказ);
            Если Отказ Тогда
                Возврат;
            КонецЕсли;
        КонецЕсли;

	КонецЕсли;
	
	Если  ЗначениеЗаполнено(АдресХранения.Лико_Секция) Тогда
		МассивОшибок = Справочники.Лико_СкладскиеСекции.ОшибкиРазмещенияПаллетаВАдрес(АдресХранения,Паллет); 
		
		
		Если МассивОшибок.Количество()>0 Тогда
			
			Отказ=Истина;
			
			Для каждого Ошибка Из МассивОшибок Цикл
				СообщитьОбОшибке(Ошибка);
			КонецЦикла;
			
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

// Подготавливает данные для проведения документа
//
// Параметры:
//  Отказ - Булево - флаг отказа от проведения (выходной параметр)
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с сериями на паллете для проведения
//
Функция ПодготовитьДанныеДляПроведения(Отказ)

    // Получаем серии, которые находятся на паллете
    ТаблицаСерий = Справочники.Лико_Паллеты2_0.СерииНаПаллете(Паллет, Дата);
    
    // Если паллет пустой - это нормально, можно перемещать пустой паллет
    Если ТаблицаСерий.Количество() = 0 Тогда
        Возврат ТаблицаСерий;
    КонецЕсли;

    // Получение остатков товаров в ячейках для проверки
    ТаблицаОстатков = Справочники.Лико_Паллеты2_0.ПолучитьОстаткиТоваровПоСериямВЯчейках(
        ТаблицаСерий,
        Дата
    );

    // Проверка достаточности остатков
    РезультатПроверки = Справочники.Лико_Паллеты2_0.ПроверитьНаличиеОстатков(ТаблицаОстатков, ТаблицаСерий);

    Если НЕ РезультатПроверки.ОстаткиДостаточны Тогда

        // Выводим заголовок ошибки
        СообщитьОбОшибке(РезультатПроверки.ТекстЗаголовка);

        // Выводим отдельные сообщения для каждой серии
        Если РезультатПроверки.Свойство("СообщенияПоСтрокам") Тогда
            Для Каждого ДанныеСообщения Из РезультатПроверки.СообщенияПоСтрокам Цикл
                СообщитьОбОшибке(ДанныеСообщения.Текст);
            КонецЦикла;
        КонецЕсли;

        // Выводим информацию о возможных причинах
        Если РезультатПроверки.Свойство("ТекстПричин") И ЗначениеЗаполнено(РезультатПроверки.ТекстПричин) Тогда
            СообщитьОбОшибке(РезультатПроверки.ТекстПричин);
        КонецЕсли;

        Отказ = Истина;
        Возврат Неопределено;
    КонецЕсли;

    Возврат ТаблицаОстатков;

КонецФункции

// Формирует все движения документов по регистрам
//
// Параметры:
//  ТаблицаСерий - ТаблицаЗначений - таблица с сериями на паллете для проведения
//
Процедура СформироватьДвиженияДокумента(ТаблицаСерий)
	
	// Проверяем, изменился ли адрес паллета
	АдресИзменен = ПроверитьИзменениеАдресаПаллета();
	
	// Движения по товарам в ячейках формируются только если адрес изменился
	Если АдресИзменен Тогда 
		
		// Формируем движения только если есть серии на паллете
		Если ТаблицаСерий <> Неопределено И ТаблицаСерий.Количество() > 0 Тогда
			СформироватьДвиженияПоРегиструТоварыВЯчейках(ТаблицаСерий);
		КонецЕсли;
		
		// Движения по регистру паллет в секциях формируются всегда при изменении адреса
		СформироватьДвиженияРегистрацииПаллеты();
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует движения регистрации паллеты в секциях
//
Процедура СформироватьДвиженияРегистрацииПаллеты()
	
	// Списание паллеты из предыдущей секции
	СформироватьДвиженияСписанияПаллетыИзСекции();

	// Регистрация паллеты в новом адресе
	Движения.Лико_ПаллетыВСекциях.Записывать = Истина;
	ДвижениеСекции = Движения.Лико_ПаллетыВСекциях.ДобавитьПриход();
	ДвижениеСекции.Период = Дата;
	ДвижениеСекции.Паллет = Паллет;
	ДвижениеСекции.Адрес = АдресХранения;
	ДвижениеСекции.Секция = АдресХранения.Лико_Секция;
	ДвижениеСекции.Количество = 1;
	ДвижениеСекции.Заблокирован = 0;

КонецПроцедуры

// Формирует движения по регистру ТоварыВЯчейках
//
// Параметры:
//  ТаблицаОстатков - ТаблицаЗначений - таблица с остатками товаров
//
Процедура СформироватьДвиженияПоРегиструТоварыВЯчейках(ТаблицаОстатков)
    
    Движения.ТоварыВЯчейках.Записывать = Истина;
    
    Для Каждого СтрокаОстатков Из ТаблицаОстатков Цикл
        
        // Если количество к перемещению = 0, пропускаем строку
        Если СтрокаОстатков.КоличествоКПеремещению <= 0 Тогда
            Продолжить;
        КонецЕсли;
        
        // Параметры движения расхода
        ПараметрыДвижения = Новый Структура;
        ПараметрыДвижения.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
        ПараметрыДвижения.Вставить("Период", Дата);
        ПараметрыДвижения.Вставить("Номенклатура", СтрокаОстатков.Номенклатура);
        ПараметрыДвижения.Вставить("Характеристика", СтрокаОстатков.Характеристика);
        ПараметрыДвижения.Вставить("Назначение", Справочники.Назначения.ПустаяСсылка());
        ПараметрыДвижения.Вставить("Упаковка", СтрокаОстатков.Упаковка);
        ПараметрыДвижения.Вставить("Ячейка", СтрокаОстатков.Ячейка);
        ПараметрыДвижения.Вставить("Серия", СтрокаОстатков.Серия);
        ПараметрыДвижения.Вставить("ВНаличии", СтрокаОстатков.КоличествоКПеремещению);
        ПараметрыДвижения.Вставить("КОтбору", 0);
        ПараметрыДвижения.Вставить("КРазмещению", 0);
        
        // Расход - списание товара с исходной ячейки
        ДобавитьДвижение(Движения.ТоварыВЯчейках, ПараметрыДвижения);
        
        // Параметры движения прихода (изменяем только вид движения и ячейку)
        ПараметрыДвижения.ВидДвижения = ВидДвиженияНакопления.Приход;
        ПараметрыДвижения.Ячейка = АдресХранения;
        
        // Приход - формирование остатков в целевой ячейке
        ДобавитьДвижение(Движения.ТоварыВЯчейках, ПараметрыДвижения);
        
    КонецЦикла;
    
КонецПроцедуры

// Добавляет движение по регистру накопления
//
// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей - набор записей регистра накопления
//  ПараметрыДвижения - Структура - параметры движения, ключи структуры должны соответствовать
//                      реквизитам, измерениям и ресурсам регистра
//
Процедура ДобавитьДвижение(НаборЗаписей, ПараметрыДвижения)

    Движение = НаборЗаписей.Добавить();
    ЗаполнитьЗначенияСвойств(Движение, ПараметрыДвижения);

КонецПроцедуры

// Проверяет, изменился ли адрес хранения паллета
//
// Возвращаемое значение:
//  Булево - Истина, если адрес паллета изменился или паллета не было в секциях
//
Функция ПроверитьИзменениеАдресаПаллета()
	
	// Находим текущую секцию паллеты на дату документа
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    ПаллетыВСекцияхОстатки.Адрес КАК Адрес,
	|    ПаллетыВСекцияхОстатки.Секция КАК Секция
	|ИЗ
	|    РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(
	|        &ДатаДокумента,
	|        Паллет = &ТекущаяПаллет
	|    ) КАК ПаллетыВСекцияхОстатки
	|ГДЕ
	|    ПаллетыВСекцияхОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("ТекущаяПаллет", Паллет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если паллета не найдена в секциях - значит это новая регистрация
	Если НЕ Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Сравниваем предыдущий адрес с новым
	ПредыдущийАдрес = Выборка.Адрес;
	НовыйАдрес = АдресХранения;
	
	// Если адреса различаются - адрес изменился
	Возврат ПредыдущийАдрес <> НовыйАдрес;
	
КонецФункции

// Формирует движения списания паллеты из предыдущей секции
//
Процедура СформироватьДвиженияСписанияПаллетыИзСекции()

    Движения.Лико_ПаллетыВСекциях.Записывать = Истина;

    // Находим текущую секцию паллеты на дату документа
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    ПаллетыВСекцияхОстатки.Адрес КАК Адрес,
    |    ПаллетыВСекцияхОстатки.Секция КАК Секция
    |ИЗ
    |    РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(
    |        &ДатаДокумента,
    |        Паллет = &ТекущаяПаллет
    |    ) КАК ПаллетыВСекцияхОстатки
    |ГДЕ
    |    ПаллетыВСекцияхОстатки.КоличествоОстаток > 0";

    Запрос.УстановитьПараметр("ДатаДокумента", Дата);
    Запрос.УстановитьПараметр("ТекущаяПаллет", Паллет);

    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда

        // Расход паллеты из предыдущей секции
        ДвижениеРасход = Движения.Лико_ПаллетыВСекциях.ДобавитьРасход();
        ДвижениеРасход.Период = Дата;
        ДвижениеРасход.Паллет = Паллет;
        ДвижениеРасход.Адрес = Выборка.Адрес;
        ДвижениеРасход.Секция = Выборка.Секция;
        ДвижениеРасход.Количество = 1;
        ДвижениеРасход.Заблокирован = 0;

    КонецЕсли;

КонецПроцедуры

// Выводит сообщение пользователю об ошибке
//
// Параметры:
//  ТекстОшибки - Строка - текст сообщения об ошибке
//
Процедура СообщитьОбОшибке(ТекстОшибки)
    
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = ТекстОшибки;
    Сообщение.Сообщить();
    
КонецПроцедуры

// Проверяет возможность проведения документа задним числом
//
// Параметры:
//  Отказ - Булево - флаг отказа от проведения (выходной параметр)
//
Процедура ПроверитьПроведениеЗаднимЧислом(Отказ)
    
    // Получаем серии, которые находятся на паллете
    СписокСерий = Справочники.Лико_Паллеты2_0.СерииНаПаллете(Паллет, Дата);
    
    Если СписокСерий.Количество() = 0 Тогда
        Возврат; // Нет серий для проверки (пустой паллет)
    КонецЕсли;
    
       
    // Запрос для поиска документов, проведенных позже данной даты и использующих те же серии
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
    |    ТоварыВЯчейках.Регистратор КАК Документ,
    |    ТоварыВЯчейках.Регистратор.Дата КАК ДатаДокумента
    |ИЗ
    |    РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
    |ГДЕ
    |    ТоварыВЯчейках.Серия В(&СписокСерий)
    |    И ТоварыВЯчейках.Регистратор <> &ТекущийДокумент
    |    И ТоварыВЯчейках.Регистратор.Дата >= &ДатаТекущегоДокумента
    |
    |УПОРЯДОЧИТЬ ПО
    |    ДатаДокумента УБЫВ";
    
    Запрос.УстановитьПараметр("СписокСерий", СписокСерий);
    Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
    Запрос.УстановитьПараметр("ДатаТекущегоДокумента", Дата);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если НЕ РезультатЗапроса.Пустой() Тогда
        
        ТаблицаДокументов = РезультатЗапроса.Выгрузить();
        КоличествоПоздних = ТаблицаДокументов.Количество();
        
        // Заголовок ошибки
        ТекстЗаголовка = НСтр("ru = 'ВНИМАНИЕ! Проведение документа невозможно.
        |
        |Вы пытаетесь провести документ датой %1, но уже существуют более поздние документы с теми же сериями товаров.
        |Проведение задним числом нарушит хронологическую последовательность движений по сериям и приведёт к ошибкам в учёте.'");
        
        ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%1", Формат(Дата, "ДЛФ=DD"));
        СообщитьОбОшибке(ТекстЗаголовка);
        
        // Выводим каждый документ отдельным сообщением с возможностью перехода
        Счетчик = 0;
        Для Каждого СтрокаДок Из ТаблицаДокументов Цикл
            
            Если Счетчик >= 20 Тогда // Ограничиваем вывод 20 документами
                Прервать;
            КонецЕсли;
            
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = Строка(СтрокаДок.Документ);
            Сообщение.КлючДанных = СтрокаДок.Документ;
            Сообщение.Сообщить();
            
            Счетчик = Счетчик + 1;
            
        КонецЦикла;
        
        Если КоличествоПоздних > 20 Тогда
            СообщитьОбОшибке("... и ещё " + Формат(КоличествоПоздних - 20, "ЧГ=0") + " документов");
        КонецЕсли;
        
        // Подсказка что делать
        ТекстПодсказки = НСтр("ru = '
        |ЧТО ДЕЛАТЬ:
        |
        |Вариант 1 (Рекомендуется):
        |  1. Измените дату документа на более позднюю (после всех зависимых документов)
        |  2. Проведите документ
        |
        |Вариант 2 (Сложный):
        |  1. Отмените проведение ВСЕХ более поздних документов (в обратном хронологическом порядке)
        |  2. Проведите этот документ
        |  3. Проведите отменённые документы заново (в хронологическом порядке)
        |
        |Вариант 3:
        |  • Используйте текущую дату для проведения документа
        |
        |Вариант 4 (Программный обход):
        |  • Установите ДополнительныеСвойства.ПропуститьПроверкуПоследовательности = Истина
        |
        |Общее количество более поздних документов: %1'");
        
        ТекстПодсказки = СтрЗаменить(ТекстПодсказки, "%1", Формат(КоличествоПоздних, "ЧГ=0"));
        СообщитьОбОшибке(ТекстПодсказки);
        
        Отказ = Истина;
        
    КонецЕсли;
    
КонецПроцедуры

// Проверяет наличие зависимых документов, использующих серии из текущего документа
//
// Параметры:
//  Отказ - Булево - флаг отказа от отмены проведения (выходной параметр)
//
Процедура ПроверитьНаличиеЗависимыхДокументов(Отказ)
    
    // Получаем серии, которые находятся на паллете
    СписокСерий = Справочники.Лико_Паллеты2_0.СерииНаПаллете(Паллет, Дата);
    
    Если СписокСерий.Количество() = 0 Тогда
        Возврат; // Нет серий для проверки (пустой паллет)
    КонецЕсли;
    
   
    
    // Запрос для поиска документов, проведенных позже и использующих те же серии
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
    |    ТоварыВЯчейках.Регистратор КАК Документ,
    |    ТоварыВЯчейках.Регистратор.Дата КАК ДатаДокумента
    |ИЗ
    |    РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
    |ГДЕ
    |    ТоварыВЯчейках.Серия В(&СписокСерий)
    |    И ТоварыВЯчейках.Регистратор <> &ТекущийДокумент
    |    И ТоварыВЯчейках.Регистратор.Дата > &ДатаТекущегоДокумента
    |
    |УПОРЯДОЧИТЬ ПО
    |    ДатаДокумента УБЫВ";
    
    Запрос.УстановитьПараметр("СписокСерий", СписокСерий);
    Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
    Запрос.УстановитьПараметр("ДатаТекущегоДокумента", Дата);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если НЕ РезультатЗапроса.Пустой() Тогда
        
        ТаблицаДокументов = РезультатЗапроса.Выгрузить();
        КоличествоЗависимых = ТаблицаДокументов.Количество();
        
        // Заголовок ошибки
        ТекстЗаголовка = НСтр("ru = 'ВНИМАНИЕ! Отмена проведения документа невозможна.
        |
        |После этого документа были проведены другие документы, использующие те же серии товаров.
        |Отмена проведения нарушит последовательность движений по сериям и приведёт к ошибкам в учёте.'");
        
        СообщитьОбОшибке(ТекстЗаголовка);
        
        // Выводим каждый документ отдельным сообщением с возможностью перехода
        Счетчик = 0;
        Для Каждого СтрокаДок Из ТаблицаДокументов Цикл
            
            Если Счетчик >= 20 Тогда // Ограничиваем вывод 20 документами
                Прервать;
            КонецЕсли;
            
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = Строка(СтрокаДок.Документ);
            Сообщение.КлючДанных = СтрокаДок.Документ;
            Сообщение.Сообщить();
            
            Счетчик = Счетчик + 1;
            
        КонецЦикла;
        
        Если КоличествоЗависимых > 20 Тогда
            СообщитьОбОшибке("... и ещё " + Формат(КоличествоЗависимых - 20, "ЧГ=0") + " документов");
        КонецЕсли;
        
        // Подсказка что делать
        ТекстПодсказки = НСтр("ru = '
        |ЧТО ДЕЛАТЬ:
        |
        |Вариант 1 (Рекомендуется):
        |  1. Сначала отмените проведение ВСЕХ зависимых документов (в обратном хронологическом порядке)
        |  2. Затем отмените проведение этого документа
        |  3. Внесите необходимые изменения
        |  4. Проведите документы заново (в хронологическом порядке)
        |
        |Вариант 2:
        |  • Создайте корректирующий документ для исправления данных
        |  • Не отменяйте проведение существующих документов
        |
        |Общее количество зависимых документов: %1'");
        
        ТекстПодсказки = СтрЗаменить(ТекстПодсказки, "%1", Формат(КоличествоЗависимых, "ЧГ=0"));
        СообщитьОбОшибке(ТекстПодсказки);
        
        Отказ = Истина;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
    ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
    |en = 'Invalid object call on the client.'");
#КонецЕсли
